jj11hh/ch554_sdcc/projects/wireless_display/main.c
    }
}

void GPIOSetup( void ) {
    // Pins:
    // LED:     P3.4 Output
    // IRQ:     P3.2 Input & Interrupt
    // MOSI:    P1.5 Output
    // MISO:    P1.6 Input
    // SCK:     P1.7 Output
    // CE:      P3.1 Output
    // CSN:     P3.0 Output

    P3_DIR_PU = 0b11111011;
    P3_MOD_OC = 0b00000000;
    // Port3: 8 7 6 5 4 3 2 1 0
    // In:                0
    // Out:   1 1 1 1 1 1   1 1

    P1_DIR_PU = 0b110111111;
    P1_MOD_OC = 0b000000000;
    // Port1: 8 7 6 5 4 3 2 1 0
    // In:        0
    // Out:   1 1   1 1 1 1 1 1

    LED = 0; // LED On
    CE = 0;  // Disable TX/RX
    CSN = 1;
    SCK = 0;

    // Enable extern interrupt 0
    IT0 = 1;
    EX0 = 1;

    EA = 1;
}

volatile bool ping = 0;

// Handle IRQ pin
void IRQ_ISR ( void ) __interrupt( INT_NO_INT0 ) {
    if (nRF24_GetStatus_RXFIFO() != nRF24_STATUS_RXFIFO_EMPTY){
        nRF24_CE_L();

        uint8_t buf;

        nRF24_ReadPayload(&buf, 1);
        nRF24_ClearIRQFlags();
        nRF24_CE_H();

        ping = 1;
    }
}


void UsbCDC_Write(const char *buf, uint8_t len) {
    // write upload endpoint
    while (!UsbConfig || UpPoint2_Busy);
    memcpy(Ep2Buffer + MAX_PACKET_SIZE, buf, len);
    UEP2_T_LEN = len; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

#define UsbCDC_CountRX USBByteCount

uint8_t UsbCDC_Read(char *buf, uint8_t max) {
    uint8_t count = 0;
    if (max == 0) return 0;
    while (!UsbConfig || !UsbCDC_CountRX);
    while (UsbCDC_CountRX && max) {
        *buf = Ep2Buffer[USBBufOutPoint ++];
        buf ++;
        max --;
        UsbCDC_CountRX --;
        count ++;
    }

    if (UsbCDC_CountRX == 0)
        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;

    return count;
}

void UsbCDC_ReadUntil(char *buf, uint8_t until) {
    while (!UsbConfig || !UsbCDC_CountRX);
    while (until){
        if (UsbCDC_CountRX) {
            *buf = Ep2Buffer[USBBufOutPoint ++];
            buf ++;
            UsbCDC_CountRX --;
            until --;
            if (UsbCDC_CountRX == 0)
                UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
        }
    }
}

static inline void nRF24_Setup () {
    nRF24_Init();

    nRF24_CE_L();

    mDelaymS(1);

    nRF24_WriteReg(nRF24_REG_EN_AA, 0x01);
    nRF24_WriteReg(nRF24_REG_EN_RXADDR, 0x01);
    nRF24_WriteReg(nRF24_REG_SETUP_AW, 0b11);
    nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x00);
    nRF24_WriteReg(nRF24_REG_RF_CH, 120);
    nRF24_WriteReg(nRF24_REG_RF_SETUP, 0b00001100);

    //nRF24_SetAddr(nRF24_REG_RX_ADDR_P0, (uint8_t *)"ziyan");
    //nRF24_SetAddr(nRF24_REG_TX_ADDR, (uint8_t *)"ziyan");

    nRF24_CSN_L();
    nRF24_LL_RW(nRF24_CMD_W_REGISTER | nRF24_REG_RX_ADDR_P0);
    nRF24_LL_RW('z');
    nRF24_LL_RW('i');
    nRF24_LL_RW('y');
    nRF24_LL_RW('a');
    nRF24_LL_RW('n');
    nRF24_CSN_H();

    nRF24_CSN_L();
    nRF24_LL_RW(nRF24_CMD_W_REGISTER | nRF24_REG_TX_ADDR);
    nRF24_LL_RW('z');
    nRF24_LL_RW('i');
    nRF24_LL_RW('y');
    nRF24_LL_RW('a');
    nRF24_LL_RW('n');
    nRF24_CSN_H();

    // 250us, 4 times retry
    nRF24_SetAutoRetr(nRF24_ARD_250us, 16);


    // 接收数据长度 17 bytes
    // 行号 + 行数 (128 bit == 16 Byte)
    nRF24_WriteReg(nRF24_REG_RX_PW_P0, 1);

    //nRF24_WriteReg(nRF24_REG_CONFIG, 0x0E); //TX
    nRF24_WriteReg(nRF24_REG_CONFIG, 0x0F); //RX

    nRF24_FlushRX();
    nRF24_FlushTX();
    nRF24_ClearIRQFlags();

    mDelaymS(10);
    nRF24_CE_H();    
}

static inline void init() {
    CfgFsys( );                                                           // CH559 clock selection configuration
    mDelaymS(5);                                                          // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
    mInitSTDIO( );                                                        // Serial port 0, can be used for debugging
    GPIOSetup();
    nRF24_Setup();

    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared
  
}

bool send_block(uint8_t *block) {

    EX0 = 0;
	nRF24_CE_L();

    // TX Mode
	nRF24_WriteReg(nRF24_REG_CONFIG, 0x0E);
	nRF24_CE_H();

    bool ok;

    nRF24_CE_L();
    nRF24_FlushTX();
    nRF24_ClearIRQFlags();
    nRF24_WritePayload(block, 17);
    nRF24_CE_H();


    uint8_t status = 0x00;

    while (1) {
        status = nRF24_GetStatus();
        if (status & ( nRF24_FLAG_MAX_RT | nRF24_FLAG_TX_DS )){
            nRF24_ClearIRQFlags();
            nRF24_FlushTX();
            break;
        }
    }

    if (status & nRF24_FLAG_TX_DS)
        ok = 1;
    else 
        ok = 0;


    mDelayuS(100);
	nRF24_CE_L();
	nRF24_FlushTX();
	nRF24_FlushRX();
	nRF24_ClearIRQFlags();

    // RX Mode
	nRF24_WriteReg(nRF24_REG_CONFIG, 0x0F);
	nRF24_CE_H();

    EX0 = 1;

    return ok;
}

//主函数
void main( void )
{
  
    init ();

    while(1)
    {
        __xdata uint8_t buf[17];
        uint8_t reply;
        uint8_t nread = 0;
        while (nread < 17) {
            nread += UsbCDC_Read(buf + nread, 17 - nread);
        }
        LED = 1; 
        if (send_block(buf))
            reply = 'S';
        else 
            reply = 'U';
        LED = 0;

        UsbCDC_Write(&reply, 1);
    }
}
